import React from 'react'
import Header from '../components/header'
import '../style/Tovar.css'
import '../style/footer.css'

import Items from '../components/Items'
import ShowFullItem from '../components/ShowFullItem';

import Q from '../images/Tovar/snapedit_1701840575306-removebg-preview.png';
import Lenova from '../images/Tovar/H33e66ed46e58430d8e7354ca3ad963267.png';
import Lenova2 from '../images/Tovar/H201aed5577234d0ca9b7544eb3a8bb7cM.png';
import Ops from '../images/Tovar/26336.750x0.jpg';
import Ops2 from '../images/Tovar/a9ba55273583c6619ddd99b329ef4d24.jpg';
import Ops3 from '../images/Tovar/ops-2.png';
import Printers from '../images/Tovar/zmorph_fab_front.png'
import Printers2 from '../images/Tovar/195545503_3d-printer-creality.png'
import Q1 from '../images/Tovar/61mdwuvXQjL._AC_SL1500_-removebg-preview.png'
import Q2 from '../images/Tovar/1530195425_1_mini7-removebg-preview.png'
import Q3 from '../images/Tovar/file_1565934014_871430537-removebg-preview.png'
import Q4 from '../images/Tovar/ge-catalog-priborylaboratornyeb-10089-420x508-removebg-preview.png'
import Q5 from '../images/Tovar/lupy-linzy-uvelichitelnye-stekla_eb02c187f914ca8_800x600.png'
import Q6 from '../images/Tovar/6101846899-removebg-preview.png'
import Q7 from '../images/Tovar/nabor_him_posudy_i_prinadlezhnostej_dlya_montazha_prostejshih_priborov_po_himii_nphl.png'
import Q8 from '../images/Tovar/aaaaaaaaaaaaaaaaaaaaabiol_new.jpg'
import T1 from '../images/Tovar/237373010.jpg'
import T2 from '../images/Tovar/file_1565862390_57211147.jpg'
import T3 from '../images/Tovar/dd4b771a46fa67255b69ed3bf1f27ac1.jpg'
import T4 from '../images/Tovar/весы.jpg'
import T5 from '../images/Tovar/61mdwuvXQjL._AC_SL1500_-removebg-preview.png'
import T6 from '../images/Tovar/sosudy-soobshhayushhiesya.jpg'
import T7 from '../images/Tovar/vederko_arhimeda_ros-servis.png'
import T8 from '../images/Tovar/IMG_2663_enl.jpg'
import T9 from '../images/Tovar/-fcfQwfs.jpg'
import T10 from '../images/Tovar/58165e9e-d5f2-45d4-8539-637ac1fb876f.jpg'
import T11 from '../images/Tovar/1 (1).jpg'
import T12 from '../images/Tovar/254636966.jpg'
import T14 from '../images/Tovar/9f08ad017997a17055da8f38426fc715.jpg'
import T15 from '../images/Tovar/30920d86357ea0fd9dc33c9ff8eab6dd.jpg'
import T16 from '../images/Tovar/70463.jpg'
import T17 from '../images/Tovar/lkdvlev.jpeg'
import T18 from '../images/Tovar/6654861450.jpg'
import T19 from '../images/Tovar/1dd41724e61c81cabd5351a56ac0e79b.jpg'
import T20 from '../images/Tovar/2470fec54041ec5e6720d6ee1f3ef824.jpeg'
import T21 from '../images/Tovar/file_1565926995_668067710.jpg'
import P1 from '../images/Tovar/1a9e623af6d4d9f009dc3f6babdf9bdc.jpg'
import P2 from '../images/Tovar/61OgQjD9sEL._AC_UL960_QL65_.jpg'
import P3 from '../images/Tovar/IMG_0554.jpg'
import P4 from '../images/Tovar/18464.jpg'
import P5 from '../images/Tovar/editor11310.jpg'
import P6 from '../images/Tovar/24057_big.jpg'
import P7 from '../images/Tovar/2542-01_big.jpg'
import P8 from '../images/Tovar/gorlka.png'
import P9 from '../images/Tovar/772.jpg'
import P10 from '../images/Tovar/hhhhhhhh.png'
import P11 from '../images/Tovar/311ccb52080711ed86e0fa163e24f085_3f19c7d2080711ed86e0fa163e24f085-1000x1000.jpg'
import P12 from '../images/Tovar/shtativ_dlya_izmeritelnyh_golovok_shm_iiv_chiz_01.jpg'
import A1 from '../images/Tovar/Windows_logo_Cyan_rgb_D.png'
import A2 from '../images/Tovar/icons8-ос-mac-500-removebg-preview.png'
import A3 from '../images/Tovar/Linux-Logo.png'
import A4 from '../images/Tovar/Webp.net-resizeimage-21.png'
import A5 from '../images/bird@2x.png'
import O from '../images/Tovar/png/110120_1-removebg-preview.png'
import O2 from '../images/Tovar/png/dc0346ac3e0e78d9d71f5dec5e28a94a-removebg-preview.png'
import O3 from '../images/Tovar/png/Work-removebg-preview.png'
import O4 from '../images/Tovar/png/68045769-removebg-preview.png'
import O5 from '../images/Tovar/png/f58207836ffcd353d4b2f45450d4b1aa-removebg-preview.png'
import O6 from '../images/Tovar/png/427_3-removebg-preview.png'
import O7 from '../images/Tovar/png/v5nuhbzqormx83dhu1o9dmyszg6mtor6-removebg-preview.png'
import O8 from '../images/Tovar/png/222-02-shkaf-detskij-5-dvernyj-81301-1-800x800-removebg-preview.png'
import O9 from '../images/Tovar/png/SHkaf-dlya-dokumentov-s-dverkami-removebg-preview.png'
import O10 from '../images/Tovar/png/1437-removebg-preview.png'
import img from '../images/Tovar/tonk-aio2700-06.jpg';
import img2 from '../images/Tovar/tonk-aio2400-09.png';
import img3 from '../images/Tovar/tonk-aio2401-07.png';
import img4 from '../images/Tovar/product_image_82595_1222018.png';
import img5 from '../images/Tovar/product_image_83749_1225749.jpg';
import img6 from '../images/Tovar/c0a09cf71ee10741ed89d0ccc779b027.jpeg';
import img7 from '../images/Tovar/5pmn0iqlv2l0pwv3z26isfabjcdvn5mx.png';
import img8 from '../images/Tovar/e7k52k7sofus77issybfnoth41f8uh7n.jpg';
import img9 from '../images/Tovar/6e5a37da4677243cfd580051bbdc4830.jpg';
import img10 from '../images/Tovar/ftjd9n5hhvgur7xwui9wyt9ngtb46h15.png';
import img11 from '../images/Tovar/8hpcmcs7klq8278s1na7b2haxlr9sfad.png';
import img12 from '../images/Tovar/xg3wi5x5eurn8arolo8g6sy3bl4q91ld.jpg';



import Lenova5 from '../images/Tovar/lenovai3-removebg-preview.png';
import Lenova3 from '../images/Tovar/c-removebg-preview.png';
import Lenova4 from '../images/Tovar/Acer_Aspire_3_A315-removebg-preview.png';
import Planshet from '../images/Tovar/4JEaHjaLeawkpZRCCWzIVjdn3nMd0OI3p7OVBwy5.jpg.png';
import Planshet2 from '../images/Tovar/52.jpg';
import Planshet3 from '../images/Tovar/jHDhAGuDbrjYDEOf8wdGIGX0kpkgbg4r7ooETGyO.jpg.png';

class All extends React.Component {
  constructor(props) {
    super(props)
    this.state = {
      item: [
        {
          id: 1,
          title: 'ИНТЕРАКТИВНАЯ ПАНЕЛЬ 55 ДЮЙМОВ',
          desc: ' Антибликовое закаленное стекло',
          image: Q,
          more: 'Интерактивная панель 55 – инновационное образовательное устройство с сенсорным экраном для интерактивных уроков и презентаций. Обеспечивает яркое отображение, множество функций взаимодействия, идеально интегрируется в образовательные процессы, способствуя повышению активности и вовлеченности учеников. '
        },
        {
          id: 101,
          title: 'ИНТЕРАКТИВНАЯ ПАНЕЛЬ 65 ДЮЙМОВ',
          desc: ' Антибликовое закаленное стекло',
          image: Q,
          more: 'Интерактивная панель 65 – инновационное образовательное устройство с сенсорным экраном для интерактивных уроков и презентаций. Обеспечивает яркое отображение, множество функций взаимодействия, идеально интегрируется в образовательные процессы, способствуя повышению активности и вовлеченности учеников. '
        },
        {
          id: 102,
          title: 'ИНТЕРАКТИВНАЯ ПАНЕЛЬ 75 ДЮЙМОВ',
          desc: ' Антибликовое закаленное стекло',
          image: Q,
          more: 'Интерактивная панель 75 – инновационное образовательное устройство с сенсорным экраном для интерактивных уроков и презентаций. Обеспечивает яркое отображение, множество функций взаимодействия, идеально интегрируется в образовательные процессы, способствуя повышению активности и вовлеченности учеников. '
        },
        {
          id: 103,
          title: 'ИНТЕРАКТИВНАЯ ПАНЕЛЬ 86 ДЮЙМОВ',
          desc: ' Антибликовое закаленное стекло',
          image: Q,
          more: 'Интерактивная панель 86 – инновационное образовательное устройство с сенсорным экраном для интерактивных уроков и презентаций. Обеспечивает яркое отображение, множество функций взаимодействия, идеально интегрируется в образовательные процессы, способствуя повышению активности и вовлеченности учеников. '
        },
        {
          id: 104,
          title: 'ИНТЕРАКТИВНАЯ ПАНЕЛЬ 110 ДЮЙМОВ',
          desc: ' Антибликовое закаленное стекло',
          image: Q,
          more: 'Интерактивная панель 110 – инновационное образовательное устройство с сенсорным экраном для интерактивных уроков и презентаций. Обеспечивает яркое отображение, множество функций взаимодействия, идеально интегрируется в образовательные процессы, способствуя повышению активности и вовлеченности учеников. '
        },
        {
          id: 2,
          title: 'LED / LCD панель GoodView M43SAH (43 ")',
          desc: 'GoodView 43" AD display, 700cd/m2, 24/7, FHD',
          image: Lenova,
          more: ' Изображения и характеристики товара могут отличаться от реальных параметров.Пожалуйста, уточняйте информацию у менеджера.'
        },
        {
          id: 3,
          title: 'ИНТЕРАКТИВНАЯ ПАНЕЛЬ X-GAME 65BC12432',
          desc: '100-240В, 50/60Гц /1486 × 901 × 88.9 мм ',
          image: Lenova2,
          more: "XG 65BC12432 - это современная интерактивная панель, разработанная для применения в образовании и бизнесе. ",

        },
        {
          id: 4,
          title: 'OPS i3 10100/8G/256G',
          desc: 'i5, 6 ядер/ОЗУ 8 GB DDR4/SSD 256GB',
          image: Ops,
          more: 'OPS i5 10100/8G/256G – мощный компьютер форм-фактора OPS с процессором Intel Core i5 10100, 8 ГБ оперативной памяти и накопителем на 256 ГБ. Идеально подходит для высокопроизводительных задач, обеспечивает быструю и эффективную работу в компактном формате.',

        },
        {
          id: 5,
          title: 'OPS i5 11400/8G/256G',
          desc: 'i3, 6 ядер/ОЗУ 8 GB DDR4/SSD 256GB',
          image: Ops2,
          more: "OPS i3 10100/8G/256G – Компактный компьютер OPS с процессором Intel Core i3 10100, 8 ГБ оперативной памяти и двумя накопителями по 256 ГБ каждый. Идеальное решение для быстрой и эффективной работы в ограниченном пространстве.",

        },
        {
          id: 6,
          title: 'OPS i3 12100/8G/256G',
          desc: 'i5, 4 ядра/SSD 128GB/ ОЗУ 8 GB DDR3',
          image: Ops,
          more: "OPS i5 4430/8G/128G – Производительный компьютер OPS с процессором Intel Core i5 4430, 8 ГБ оперативной памяти и накопителем на 128 ГБ. Обеспечивает высокую производительность для разнообразных задач в компактном форм-факторе.",
        },
        {
          id: 7,
          title: 'OPS i5 8400/8G/128G',
          desc: 'i5, 4 ядра/SSD 128GB/ ОЗУ 8 GB DDR3',
          image: Ops,
          more: "OPS i5 4430/8G/128G – Производительный компьютер OPS с процессором Intel Core i5 4430, 8 ГБ оперативной памяти и накопителем на 128 ГБ. Обеспечивает высокую производительность для разнообразных задач в компактном форм-факторе.",

        },
        {
          id: 8,
          title: 'OPS i5 6400/4G/128G',
          desc: 'i5, 4 ядра/SSD 128GB/ ОЗУ 8 GB DDR3',
          image: Ops,
          more: "OPS i5 4430/8G/128G – Производительный компьютер OPS с процессором Intel Core i5 4430, 8 ГБ оперативной памяти и накопителем на 128 ГБ. Обеспечивает высокую производительность для разнообразных задач в компактном форм-факторе.",

        },
        {
          id: 9,
          title: 'OPS i5 4430/8G/128G',
          desc: 'i5, 4 ядра/SSD 128GB/ ОЗУ 8 GB DDR3',
          image: Ops,
          more: "OPS i5 4430/8G/128G – Производительный компьютер OPS с процессором Intel Core i5 4430, 8 ГБ оперативной памяти и накопителем на 128 ГБ. Обеспечивает высокую производительность для разнообразных задач в компактном форм-факторе.",
        },
        {
          id: 10,
          title: 'OPS i3 2310M/4G/128G',
          desc: 'i5, 4 ядра/SSD 128GB/ ОЗУ 8 GB DDR3',
          image: Ops,
          more: "OPS i5 4430/8G/128G – Производительный компьютер OPS с процессором Intel Core i5 4430, 8 ГБ оперативной памяти и накопителем на 128 ГБ. Обеспечивает высокую производительность для разнообразных задач в компактном форм-факторе.",
        },
        {
          id: 11,
          title: 'OPS i3-2102/4G/128G',
          desc: 'i5, 4 ядра/SSD 128GB/ ОЗУ 8 GB DDR3',
          image: Ops,
          more: "OPS i5 4430/8G/128G – Производительный компьютер OPS с процессором Intel Core i5 4430, 8 ГБ оперативной памяти и накопителем на 128 ГБ. Обеспечивает высокую производительность для разнообразных задач в компактном форм-факторе.",
        },
        // начало 
        {
          id: 12,
          title: 'MAXON OPS',
          desc: 'I5/8400/8/256SSD',
          image: Ops3,
          more: "MAXON Встраиваемый компьютер для панелей Intech/MAXON OPS i5/8400/8Gb/256SSD. Процессор I5 8400 6 ядра / 6 потока 2.8 Ггц.",
        },
        {
          id: 13,
          title: 'MAXON OPS',
          desc: 'i7/10875H/8Gb/256SSD',
          image: Ops3,
          more: "MAXON Встраиваемый компьютер для панелей Intech/MAXON OPS i7/10875H/8Gb/256SSD. Процессор i7 10875H - 8 ядра / 16 потока 2.3 Ггц . ",
        },
        {
          id: 14,
          title: 'MAXON OPS',
          desc: 'i7/10875H/16Gb/512SSD',
          image: Ops3,
          more: "MAXON Встраиваемый компьютер для панелей Intech/MAXON OPS i7/10875H/16Gb/512SSD. Процессор i7 10875H - 8 ядра / 16 потока 2.3 Ггц . Производитель: MAXON.",
        },
        {
          id: 15,
          title: '',
          desc: 'i7/1255U/16Gb/512SSD',
          image: Ops3,
          more: "MAXON Встраиваемый компьютер для панелей Intech/MAXON OPS i7/1255U/16Gb/512SSD. Процессор i7 1255U - 10 ядер / 12 потока 1.7 - 4.7 Ггц . Производитель: MAXON",
        },
        {
          id: 16,
          title: 'MAXON OPS',
          desc: 'i5/1035G1/8Gb/512SSD',
          image: Ops3,
          more: "MAXON Встраиваемый компьютер для панелей Intech/MAXON OPS i5/1035G1/8Gb/512SSD. Процессор i5 1035G1 - 4 ядра / 8 потока 1-3.6 Ггц . Производитель: MAXON.",
        },
        {
          id: 17  ,
          title: 'MAXON OPS',
          desc: 'i5/1035G1/8Gb/256SSD',
          image: Ops3,
          more: "MAXON Встраиваемый компьютер для панелей Intech/MAXON OPS i5/1035G1/8Gb/256SSD. Процессор i5 1035G1 - 4 ядра / 8 потока 3.6 Ггц. Производитель: MAXON. ",
        },
        {
          id: 120,
          title: 'Моноблок HP 34 inch All-in-One ',
          desc: ' i9-12900 / 64GB / No 2nd | 1TB M.2 SSD TLC ',
          image: img4,
          more: "34.0AiOIDSBUDT / 34.0 inch AR WUHD (5120x2160) LED UWVA 500 bnt LCD Panel / i9-12900 / 64GB / No 2nd | 1TB M.2 SSD TLC / W11 ProHighEnd / 1yw | 3Y Service Upgrade / NVIDIARTX 3060 MaxQ 6 GB.",
        },
        {
          id: 121,
          title: 'HP 5V9L0EA HP ',
          desc: 'EliteOne 870 27NT G9 AiO i7-12700 16GB/512 Win11Pro',
          image: img7,
          more: "HP 5V9L0EA HP EliteOne 870 27NT G9 AiO i7-12700 16GB/512 Win11Pro 870 G9 AiO NT FHD RCTO / i7-12700 / 16GB DDR5 / 512GB M.2 SSD TLC / W11 Pro / 3Y Service Upgrade | 1yw / 655 Wrless kbd&mouse Combo / Height Adjust Stand 24 / No MCR / Corp-Ready | LBL TCO / Intel AX211 Wi-Fi 6E Vpro 160 MHz BT 5.3 WW WLAN / 5MP Camera",
        },
        {
          id: 122,
          title: 'HP All-in-One ProOne 440 G9 ',
          desc: ' Intel Core i7-12700T (3.4 ГГц), RAM 16 ГБ, SSD 512, Intel UHD Graphics 770, Windows ',
          image: img5,
          more: "Расширенные интеллектуальные функции этого моноблока помогают уменьшить нежелательный фоновый шум и адаптироваться к окружающему освещению. ",
        },
        {
          id: 123,
          title: 'Lenovo V30a 24IIL 23.8 11LA0055RU ',
          desc: ' USB 2.0   USB 3.x  Ethernet (LAN / RJ45)  HDMI    2 порта ',
          image: img6,
          more: "34.0AiOIDSBUDT / 34.0 inch AR WUHD (5120x2160) LED UWVA 500 bnt LCD Panel / i9-12900 / 64GB / No 2nd | 1TB M.2 SSD TLC / W11 ProHighEnd / 1yw | 3Y Service Upgrade / NVIDIARTX 3060 MaxQ 6 GB.",
        },
        {
          id: 124,
          title: 'X-Game Walkiria Q500 PRO',
          desc: 'FHD/ Core i3-10100T/ 8 GB DDR4/ 512 GB SSD/ Dos',
          image: img8,
          more: "Моноблоки X-GAME - все что нужно для учебы работы и отдыха в элегантном корпусе. Данное решение подойдет людям, желающим совместить мощность и функциональность настольного ПК с компактностью. Богатый функционал, отличная производительность и безупречное качество вот отличительные черты продукции компании. Превосходное сочетание формы и функциональности идеально впишется в любое пространство.",
        },
        {
          id: 125,
          title: 'Lenovo V50a-24IMB AIO, 23.8" FHD',
          desc: 'Core i5-10400T/ 8 GB/ 256 GB SSD/ Win10 Pro',
          image: img9,
          more: "Моноблок Lenovo V50a на базе процессора Intel Core 10-го поколения с внушительным ресурсом памяти и большим хранилищем данных обеспечивает производительность, достаточную для решения любых задач. Моноблок имеет несколько сертификатов в сфере экологической безопасности, помогая вам экономить на счетах за электроэнергию.",
        },
        {
          id: 126,
          title: 'HP 6D433EA HP 205 G8 All-in-One 23.8',
          desc: 'R5-5500U 16GB/512 Win11Pro Gray',
          image: img10,
          more: "HP 6D433EA HP 205 G8 All-in-One 23.8 R5-5500U 16GB/512 Win11Pro Gray 205G824AiOBU-R5-5500UIDS / 23.8 inch AG FHD (1920x1080) LED UWVA IPS 250 LCD Panel / 16GB DDR4 / 512GB M.2 SSD Value / W11 Pro / 1yw / 125 BLKkbd / 125mouse / Realtek 8852BE Wi-Fi 6 BT 5.3 WW WLAN / RTF Card / Iron Gray with 5MP WebCam ID / Sea and Rail",
        },
        {
          id: 127,
          title: 'ASUS A3202WBAK-BA105M Black/21.45 FHD',
          desc: 'I5-1235U/8GB/512GB PCIE G3 SSD/WiFi6+BT5.3/720p HD/90W/WL kbms/No OS',
          image: img11,
          more: "Моноблок ASUS A3202WBAK-BA105M Black/21.45 FHD/I5-1235U/8GB/512GB PCIE G3 SSD/WiFi6+BT5.3/720p HD/90W/WL kbamp;ms/No OS",
        },
        {
          id: 128,
          title: 'HP 200 G4 AiO [6D417EA] 21.5" FHD',
          desc: 'Core i5-1235U/ 8 GB/ 512 GB SSD/ DOS',
          image: img12,
          more: 'Недорогой моноблок HP 200 22 с минималистичным дизайном прекрасно подойдет для любого офиса. Мощные процессоры Intel помогут быстро справляться с повседневными задачами, а экран с диагональю 21,5" имеет достаточный размер для совместной работы с коллегами.',
        },
        {
          id: 129,
          title: 'Моноблок TONK AIO2700',
          desc: 'Intel i5-12500, 16Gb RAM, 512Gb SSD, 5Mp camera, WiFi+BT',
          image: img,
          more: "TONK AIO2700-  Моноблок “все в одном” (AIO) с 27-дюймовым LED-дисплеем, поддерживающим разрешение Full HD (FHD), оснащен процессором с сокетом LGA1700 (H610 чипсет).",
        },
        {
          id: 130,
          title: 'Моноблок TONK AIO2401',
          desc: 'Intel i5-12456U, 8Gb RAM, 256Gb SSD, 2Mp camera, WiFi+BT',
          image: img3,
          more: "TONK AIO2401 –  Моноблок “все в одном” (AIO) с 23,8-дюймовым LED-дисплеем, поддерживающим разрешение Full HD (FHD), оснащен процессором с сокетом LGA1700 (H610 чипсет).",
        },
        {
          id: 131,
          title: 'Моноблок TONK AIO2400',
          desc: 'Intel i3-12100, 8Gb RAM, 256Gb SSD, 2Mp camera, WiFi+BT',
          image: img2,
          more: "TONK AIO2400 –  Моноблок “все в одном” (AIO) с 23,8-дюймовым LED-дисплеем, поддерживающим разрешение Full HD (FHD), оснащен процессором с сокетом LGA1700 (H610 чипсет).",
        },
        {
          id: 132,
          title: 'Ноутбук Lenovo IdeaPad 3',
          desc: 'i5 1235U / 8ГБ / 512SSD / 15.6 / Win11',
          image: Lenova5,
          more: 'Ноутбук Lenovo IP3 15,6"FHD/Ryzen 5-5500U/8GB/256GB/Dos (82KU00C3RK)',
        },
        {
          id: 133,
          title: 'Ноутбук Asus ExpertBook B1 B1500',
          desc: 'i5 1235U / 8ГБ / 512SSD / 15.6 / Win11',
          image: Lenova3,
          more: "Диагональ экрана, дюйм - 15.6  Разрешение экрана - 1920x1080  Процессор - Celeron  Частота процессора, ГГц - 1.8  Количество ядер - 2",
        },
        {
          id: 134,
          title: 'Ноутбук Acer Aspire 3 A315-56',
          desc: 'Ноутбук Acer Aspire 3 A315-56 (15.6 FHD/ Core i3 1005G1/ 8Gb DDR4-3200/ 512Gb SSD/ Intel UHD/noOD/ DOS) ',
          image: Lenova4,
          more: "Диагональ экрана, дюйм - 15.6  Разрешение экрана - 1920x1080  Процессор - Core i3  Частота процессора, ГГц - 1.2  Количество ядер - 2",
        },
        {
          id: 135,
          title: "Galaxy Tab S9 11 5G 256GB ",
          desc: " Wi-Fi 64GB - Silver (MK2L3RK/A)",
          image: Planshet,
          more: " Galaxy Tab S9  реагирует быстрее в любой ситуации: когда вы отправляете сообщения, ищете контент в интернете или используете одновременно несколько приложений.",
        },
        {
          id: 136,
          title: "Apple iPad Pro 4 -й Gen",
          desc: ' 128 ГБ, Wi-Fi, 12.9in - серый серебристый',
          image: Planshet2,
          more: "Дисплей 8,7 дюйма │ Вес 366 г │ Металлический корпус Широкий 8,7-дюймовый дисплей для ярких впечатлений от фильмов и игр. Тонкая рамка позволила увеличить экран без изменения размеров планшета. Благодаря компактному эргономичному корпусу планшет очень удобно держать в руках, даже работая и играя часами.",
        },
        {
          id: 137,
          title: 'Планшет Samsung Galaxy Tab S9+ 12.4 256GB Graphite ',
          desc: ' алюминий/ 8 ядер/256 ГБ/3.3 ГГц/Qualcomm Snapdragon 8 Gen 2',
          image: Planshet3,
          more: "Диагональ экрана, дюйм - 15.6  Разрешение экрана - 1920x1080  Процессор частота процессора, ГГц - 1.2  Количество ядер - 2",
        },
        {
          id: 18,
          title: 'ZMORPH FAB',
          more: 'Расширьте свои производственные возможности благодаря доступу к более чем 50 профессиональным материалам как для субтрактивного, так и для аддитивного производства.',
          image: Printers,
          desc:'От пластиковой нити для 3D-печати до мягких металлов и твердых пластиков.'
        },
        {
          id: 19,
          title: '3D принтер Creality Ender-3 Neo',
          more: '3D-принтер Creality Ender-3 Neo это новая улучшенная версия самой популярной бюджетной модели среди пользователей Creality Ender-3.В Ender-3 Neo появился цельнометаллический боуден-экструдер, автокалибровка CR-Touch собственной разработки Creality, гофрированный теплоотвод для лучшего рассеивания тепла и многое другое.',
          image: Printers2,
          desc:'Более простая и быстрая калибровка платформы CR Touch'
        },
        {
          id: 20,
          title: 'ВЕСЫ ЭЛЕКТРОННЫЕ',
          desc: 'Габаритные размеры: не менее 190x138x28 mm00',
          image: Q1,
          more: "Диапазон взвешивания 0-200 д,погрешность 0,1g, размер чашки весов 115 mm. Питается от элемента питания напряжением 5V и от сети - 220V.",
        },
        {
          id: 21,
          title: 'СТОЛИКИ ПОДЪЕМНЫЕ',
          desc: 'Максимальная высота подъема: не менее 280 mm',
          image: Q2,
          more: "Предназначен для демонстрации приборов и монтажа элемент-то в различных установок на разной высоте. Размер рабочей поверхности поверхности столика: не менее 150x150 mm. ",

        },
        {
          id: 22,
          title: 'ШТАТИВ ЛАБОРАТОРНЫЙ',
          desc: 'Металлический штатив, используют при монтаже демонстрационных онных приборов и установок.',
          image: Q3,
          more: "В комплект входят: муфты - 5 шт., лапки - 3 шт., четырехпальчиковый зажим - 2 шт., кольца - 3 шт. разного диаметра, стойки - 3 шт. (2 длинных, 1 короткая), раз сдвижная платформа из двух частей",

        },
        {
          id: 23,
          title: 'МИКРОСКОП УЧЕБНЫЙ',
          desc: 'Увеличение 100 х - 640 х крат',
          image: Q4,
          more: "Имеет подвижный предметный столик, тубус с двумя сменными окулярами (10 х, 16 х); три объектива (4 х, 10 х, 40 х), расположена женные на вращающейся револьверной головке.",

        },
        {
          id: 24,
          title: 'ЛУПА',
          desc: 'Используется на уроках и при проведении наблюдений в природе БИНОКЛЬ',
          image: Q5,
          more: "Используется на экскурсиях при проведении наблюдений в природе роде",

        },
        {
          id: 25,
          title: 'МИКРОСКОП С ЭЛЕКТРОПОДСВЕТКОЙ',
          desc: 'Предназначен для наблюдения объектов в проходящем свете в светлом поле.',
          image: Q6,
          more: "В микроскопе используется зеркальный освети- тель естественного освещения. Может использоваться в различ- ных областях медицины и учебных учреждениях различного про- филя при проведении лабораторных работ.",

        },
        {
          id: 26,
          title: 'НАБОР ХИМИЧЕСКОЙ ПОСУДЫ',
          desc: 'И ПРИНАДЛЕЖНОСТЕЙ ДЛЯ ЛАБОРАТОРНЫХ РАБОТ ПО БИОЛОГИИ',
          image: Q7,

        },
        {
          id: 27,
          title: 'Биологическая микролаборатория',
          desc: 'Биологическая микролаборатория предназначена для проведения учащимися наблюдений, лабораторных и практических работ по школьному курсу биологии.',
          image: Q8,
          more: "Обеспечивает проведение 89 лабораторных работ, в том числе 68 работ по биологии и 21 работа по экологии в соответствии с требованиями учебных программ школьного курса, по разделам:растения, бактерии, грибы, лишайники; животные; человек и его здоровье;общие биологические закономерности; экологический практикум",

        },
        {
          id: 30,
          title: 'НАБОР ДЛЯ СОСТАВЛЕНИЯ ОБЪЕМНЫХ МОДЕЛЕЙ МОЛЕКУЛ',
          desc: 'Предназначен для электропитания демонстрационных установок.',
          image: T1,
          more: "Интервал регулируемых напряжений постоянного и переменного тока от 2V до 24V, 12 режимов переключения напряжения; Мак- симальный ток нагрузки 6А. Интервал регулируемых напряжений постоянного тока 6V, 9V, 12V. Максимальный ток нагрузки 1А. На- пряжения питания 220V, 50 Hz",

        },
        {
          id: 31,
          title: 'НАБОР МОДЕЛЕЙ КРИСТАЛЛИЧЕСКИХ РЕШЕТОК АЛМАЗА',
          desc: 'ГРАФИТА, ОКСИДА УГЛЕРОДА, ПОВАРЕННОЙ СОЛИ, ЙОДА, ЛЬДА, ОКСИДА КРЕМНИЯ, МЕДИ, ЖЕЛЕЗА, МАГНИЯ.',
          image: T2,

        },
        {
          id: 32,
          title: 'НАБОР ТЕЛ РАВНОГО ОБЪЕМА',
          desc: 'Предназначен для демонстрации неодинаковой плотности раз- личных веществ путем сравнения массы тел между собой.',
          image: T3,
          more: "Набор состоит из прямоугольных брусков из стали, алюминия и пласт- массы одинакового размера.",

        },
        {
          id: 33,
          title: 'ВЕСЫ ТЕХНИЧЕСКИЕ',
          desc: 'Весы технические демонстрационные служат для демонстрации устройства и действия рычажных весов ',
          image: T4,
          more: "применяют их в качестве чувствительного индикатора при сравнении масс тел, а также для взвешивания воздуха, углекислого газа, демонстрации архимедо- вой силы для газов и в других опытах.",

        },
        {
          id: 34,
          title: 'ВЕСЫ ЭЛЕКТРОННЫЕ',
          desc: 'Прибор предназначен для измерения массы тел до 1000 г при проведении опытов по физике и химии.',
          image: T5,
          more: "Технические характери- стики Допустимая нагрузка, г, не более 1000 Точность взвешива- ния, г, до 0,2 Рабочая температура, °С+10…+30 шт. 1 4. 9 Насос воздушный ручной Применяется в ряде опытов, когда требуется сравнительно небольшое разрежение или нагнетание воздуха. Насос поршневой двойного действия. Максимальное разрешение 40 мм рт. ст., нагнетание 4 ат.",

        },
        {
          id: 35,
          title: 'СОСУДЫ СООБЩАЮЩИЕСЯ',
          desc: 'Набор состоит из сосудов разной формы и диаметра на под- ставке. Все сосуды соединены между собой одной горизонталь- ной трубкой с отростком для установки прибора в подставку.',
          image: T6,

        },
        {
          id: 36,
          title: 'ВЕДЕРКО АРХИМЕДА',
          desc: 'Предназначено для демонстрации действия жидкости на погру- женное в нее тело.',
          image: T7,
          more: "Состоит из ведерка, цилиндра и пружинного динамометра.",
        },
        {
          id: 37,
          title: 'ШАР ПАСКАЛЯ',
          desc: 'Предназначен для проведения демонстрационных опытов по ги-дро- и аэростатике.',
          image: T8,
          more: "Прибор состоит из полого металлического шара с отверстиями, цилиндра, поршня со штоком и ручкой.",
        },
        {
          id: 38,
          title: 'ТРУБКА НЬЮТОНА',
          desc: 'Предназначена для демонстрации одновременного падения тел разной массы в разреженном воздухе.',
          image: T9,
          more: "Трубка изготовлена из тол- с того прозрачного стекла. Один конец трубки закрыт. На другом конце трубки закреплена пластмассовая оправа с краном. Вну- три трубки находятся: птичье перо, кусок пробки и свинцовая дро- бинка. Используется с насосом вакуумным.",
        },
        {
          id: 39,
          title: 'МОДЕЛЬ ЧЕТЫРЕХТАКТНОГО ДВИГАТЕЛЯ',
          desc: 'Предназначена для демонстрации работы двигателя внутреннего сгорания. ',
          image: T10,
          more: "Модель выполнена в виде разреза корпуса двигателя внутреннего сгорания. На корпусе смонтированы все детали дви- гателя, окраской выделены основные его части и показана кине- матическая схема взаимодействия между ними. С боковой сто- роны корпуса имеется рукоятка, с помощью которой приводится во вращение вал двигателя, соединенный с кривошипношатун- ным и распределительным механизмами.",
        },
        {
          id: 40,
          title: 'МАЯТНИК МАКСВЕЛЛА',
          image: T11,
          more: "Установка позволяет ознакомиться со сложным движением твер- дого тела, изучить закон сохранения энергии на примере движе- ния маятника Максвелла и демонстрировать переход потенци- альной энергии в кинетическую энергию и наоборот.",
        },
        {
          id: 41,
          title: 'ПИСТОЛЕТ',
          image: T12,
          more: "Предназначен для демонстрации движения тел, баллистический брошенных под разными углами к горизонту.",
        },
        {
          id: 43,
          title: 'КОМПЛЕКТ ТЕЛЕЖЕК ЛЕГКОПОДВИЖНЫХ',
          image: T14,
          more: "Комплект тележек легкоподвижных должен позволять проведен- ние демонстраций по закономерностям взаимодействия тел, при-образованию энергии, относительности механического движения, моделированию поведения разомкнутых и замкнутых систем тел",
        },
        {
          id: 44,
          title: 'КАМЕРТОНЫ НА РЕЗОНИРУЮЩИХ ЯЩИКАХ МОЛОтОЧКОМ',
          desc: '',
          image: T15,
          more: "Предназначены для проведения демонстрационных опытов по акустике с использованием комплекта компьютерных изме- зрительных датчиков с регистратором данных. Представляют собой комплект из двух одинаково- вых камертонов с частотой 440 Hz, которые установлены на резо- нирующие ящики с одной открытой торцевой стенкой. В комплект входит молоточек для возбуждения камертонов.",
        },
        {
          id: 45,
          title: 'НАБОР ПРУЖИН РАЗЛИЧНОЙ ЖЕСТКОСТИ',
          disc:'Предназначен для демонстрации удлинения пружины от массы подвешиваемого груза.',
          image: T16,
          more: "В набор входят 5 пружин жесткостью: не менее 25, 15, 10, 5, 2,5 N/m.",
        },
        {
          id: 46,
          title: 'НАБОР ПРОВОЛОЧНЫХ КАРКАСОВ ',
          desc: '',
          image: T17,
          more: "Набор проволочных каркасов предназначен для определения ко- эффициента поверхностного натяжения жидкости с использова- нием комплекта компьютерных измерительных датчиков с реги- стратором данных (датчик силы). Состоит из динамометра - диа- пазон измерения 0-10 mN., чаши, 6 проволочных каркасов, метал- лического кольца на нитяном подвесе.",
        },
        {
          id: 47,
          title: 'КОМПЛЕКТ ПРИБОРОВ ДЛЯ ИЗУЧЕНИЯ ЭЛЕКТРОМАГНИТНЫХ ВОЛН',
          desc: '',
          image: T18,
          more: "Предназначен для проведения опытов по разделу «Электромаг-нитные колебания». В состав комплекта входят высокочастотный передатчик с частотой колебания не менее 11 GHz мощностью излучения не менее 10 mW, высокочастотный приемник, треу- угольная призма,три экрана на подставке, неоновая лампа на под- ставке, поглощающие тела.",
        },
        {
          id: 48,
          title: 'ПРИБОР ДЛЯ ДЕМОНСТРАЦИИ АТМОСФЕРНОГО ДАВЛЕНИЯ',
          desc: '',
          image: T19,
          more: "Установка позволяет ознакомиться со сложным движением твер- дого тела, изучить закон сохранения энергии на примере движе- ния маятника Максвелла и демонстрировать переход потенци- альной энергии в кинетическую энергию и наоборот.",
        },
        {
          id: 49,
          title: 'ПРИБОР ДЛЯ ДЕМОНСТРАЦИИ ТЕПЛОПРОВОДНОСТИ ТЕЛ',
          desc: '',
          image: T20,
          more: "Прибор представляет собой круглую металлическую пластину, в торец которой на равном расстоянии друг от друга вставлены пять одинаковых по размеру металлических стержней(стальной, алюминиевый и латунный). На каждом стержне имеются лунки для закрепления в них стержней с помощью пластилина.",
        },
        {
          id: 50,
          title: 'ТРУБКА ДЛЯ ДЕМОНСТРАЦИИ КОНВЕКЦИИ В ЖИДКОСТИ',
          desc: '',
          image: T21,
          more: "Предназначена для демонстрации явления конвекции жидкости при ее нагревании. Прибор представляет собой 0- образуются- кальянную трубку",
        },
        {
          id: 70,
          title: 'НАБОР ДЛЯ СОСТАВЛЕНИЯ ОБЪЕМНЫХ МОДЕЛЕЙ МОЛЕКУЛ',
          desc: 'НАБОР ДЛЯ СОСТАВЛЕНИЯ ОБЪЕМНЫХ МОДЕЛЕЙ МОЛЕКУЛ.',
          image: P1,

        },
        {
          id: 71,
          title: 'НАБОР МОДЕЛЕЙ КРИСТАЛЛИЧЕСКИХ РЕШЕТОК АЛМАЗА',
          desc: 'ГРАФИТА, ОКСИДА УГЛЕРОДА, ПОВАРЕННОЙ СОЛИ, ЙОДА, ЛЬДА, ОКСИДА КРЕМНИЯ, МЕДИ, ЖЕЛЕЗА, МАГНИЯ.',
          more:'алмаза, графита, оксида углерода, поваренной соли, йода, льда, оксида кремния, меди, железа, магния. Набор демонстрирует ионные, атомные, молекулярные,металлические кристалличе- ские решетки на примере десяти химических веществ',
          image: P2,

        },
        {
          id: 72,
          title: 'РЕШЁТКИ КРИСТАЛЛИЧЕСКИЕ АЛМАЗА,',
          desc: 'ГРАФИТА, ОКСИДА УГЛЕРОДА, ПОВАРЕННОЙ СОЛИ, ЙОДА, ЛЬДА, ОКСИДА КРЕМНИЯ, МЕДИ, ЖЕЛЕЗА, МАГНИЯ.',
          image: P3,
          more: "алмаза, графита, оксида углерода, поваренной соли, йода, льда, оксида кремния, меди, железа, магния. Набор демонстрирует ионные, атомные, молекулярные,металлические кристалличе- ские решетки на примере десяти химических веществ.",

        },
        {
          id: 73,
          title: 'АППАРАТ ДЛЯ ДИСТИЛЛЯЦИИ ВОДЫ',
          desc: ' ',
          image: P4,
          more: "Предназначен для производства дистиллированной воды",

        },
        {
          id: 74,
          title: 'БАНЯ КОМБИНИРОВАННАЯ',
          desc: 'Нагревательный прибор, состоит из резервуара с нагреватель- ным элементом для воды и для песка',
          image: P5,
          more: "Обеспечивающих нагрева- ние веществ в разных температурных диапазонах. Температура нагрева в водяной бане 100 С°, температура нагрева в песочной бане 300 C°. Напряжение питания 220 V, 50 Hz..",

        },
        {
          id: 75,
          title: 'МАГНИТНАЯ МЕШАЛКА С ПОДОГРЕВОМ',
          desc: 'Предназначена для перемешивания жидкостей с помощью вра- щающегося в магнитном поле якоря.',
          image: P6,
          more: "Максимальный перемеши- ваемый объем 1000 ml. Электропитание от сети переменного тока напряжением 220V. Диапазон вращения якоря от 120 до 1500 об/ мин",
        },
        {
          id: 76,
          title: 'НАБОР АРЕОМЕТРОВ',
          image: P7,
          more: "Предназначены для изучения устройства ареометра и измерения плотности жидкостей. Диапазон от 700 до 1840 kg/m3. В наборе 19 штук",

        },
        {
          id: 77,
          title: 'ГОРЕЛКА УНИВЕРСАЛЬНАЯ',
          desc: 'Горелка представляет собой стеклянный корпус с впаянной га- зоподводящей наружной трубкой',
          image: P8,
          more: "Горелка представляет собой стеклянный корпус с впаянной га- зоподводящей наружной трубкой и внутренней газоподводящей стеклянной трубкой, вставленной в корпус с помощью резиновой пробки. На верхней части внутренней трубки через резиновый па- трубок закреплен отрезок кварцевой термостойкой трубки",

        },
        {
          id: 78,
          title: 'ПРИБОР ДЛЯ ИЛЛЮСТРАЦИИ ЗАВИСИМОСТИ СКОРОСТИ ХИМИЧЕСКОЙ РЕАКЦИИ ОТ УСЛОВИЙ',
          desc: 'Прибор позволяет продемонстрировать зависимость скорости химической реакции',
          image: P9,
          more: "Прибор позволяет продемонстрировать зависимость скорости химической реакции от следующих факторов: природы реагиру- ющих веществ, концентрации, температуры, поверхности сопри- косновения реагирующих веществ, катализатора, ингибитора",
        },
        {
          id: 79,
          title: 'ПРИБОР ДЛЯ ОКИСЛЕНИЯ СПИРТА НАД МЕДНЫМ КАТАЛИЗАТОРОМ',
          desc: '',
          image: P10,
          more: "Служит для демонстрации получения альдегида из спирта.",
        },
        {
          id: 80,
          title: 'КОМПЛЕКТ ПРИБОРОВ ДЛЯ ОПЫТОВ С ЭЛЕКТРИЧЕСКИМ ТОКОМ',
          desc: 'Предназначен для определения электрической проводимости ве- ществ, сравнение электропроводности концентрированных и раз- бавленных растворов',
          image: P11,
          more: "Предназначен для определения электрической проводимости ве- ществ, сравнение электропроводности концентрированных и раз- бавленных растворов, проведение электролиза солей и воды, испы- тания продуктов электролиза и проведения электрохимической кор- эрозии металлов. В состав комплекта входят: емкость для электро- литической ванны с крышкой, на которой размещены токоподводы с двумя универсальными электрододержателями; электроды: сталь- ные - 2 шт., медные - 2 шт., цинковые - 2 шт., графитовые - 2 шт.; ап- парад Гоффмана; миллиамперметр.",
        },
        {
          id: 81,
          title: 'Штатив физический ',
          desc: 'Штатив физический универсальный является вспомогательным учебным оборудованием',
          image: P12,
          more: "Штатив физический универсальный является вспомогательным учебным оборудованием и предназначен для сборки установок и крепления различных приборов, приспособлений при демонстрации опытов из всех разделов курса физики.",
        },
        {
          id: 81,
          title: 'Microsoft Windows',
          desc: 'Используется на множестве устройств, включая персональные компьютеры, ноутбуки и серверы.',
          image: A1,
          more:'Windows — группа семейств коммерческих проприетарных операционных систем корпорации Microsoft, ориентированных на управление с помощью графического интерфейса. ',

        },
        {
          id: 82,
          title: 'macOS',
          desc: 'Интеграция с другими продуктами Apple, высокий уровень безопасности.',
          more:'macOS — проприетарная операционная система компании Apple. Является преемницей Mac OS 9. Семейство операционных систем macOS является вторым по распространённости для десктопа.',
          image: A2,

        },
        {
          id: 83,
          title: 'Linux',
          desc: 'Открытый исходный код, разработка сообществом.',
          image: A3,
          more: "Linux — семейство Unix-подобных операционных систем на базе ядра Linux, включающих тот или иной набор утилит и программ проекта GNU, и, возможно, другие компоненты.",

        },
        {
          id: 84,
          title: 'Roqed',
          desc: 'Позволяет вам создавать собственные слайд-шоу с использованием 3D-моделей',
          image: A4,
          more: "Roqed позволяет вам создавать собственные слайд-шоу с использованием 3D-моделей, дополняя ваши презентации интерактивными элементами и специальными вопросами для проверки знаний. ",

        },
        {
          id: 85,
          title: 'mozaBook',
          desc: 'Предназначенное для использования на интерактивных панелях в учебных классах',
          image: A5,
          more: "mozaBook - это программное обеспечение для презентаций, предназначенное для использования на интерактивных панелях в учебных классах.",

        },
        {
          id: 90,
          title: 'СТОЛ УЧЕНИЧЕСКИЙ ',
          desc: 'Стол лабораторный для кабинетов химии, физики и биологии',
          image: O,
          more:'Указан размер одного стола. При необходимости столы могут ком- пановаться в один общий лабора- торный стол. Может быть изготов- лен как со стеллажом (надстрой- кой с полками), так и без него.'
        },
        {
          id: 91,
          title: 'СТУЛ УЧЕНИЧЕСКИЙ',
          desc: 'Стол лабораторный для кабинетов химии, физики и биологии',
          image: O2,
          more:'Указан размер одного стола. При необходимости столы могут ком- пановаться в один общий лабора- торный стол. Может быть изготов- лен как со стеллажом (надстрой- кой с полками), так и без него.'
        },
        {
          id: 92,
          title: 'СТОЛ ДЛЯ ПРЕПОДАВАТЕЛЯ УГЛОВОЙ ',
          desc: 'Стол лабораторный для кабинетов химии, физики и биологии',
          image: O3,
          more:'Указан размер одного стола. При необходимости столы могут ком- пановаться в один общий лабора- торный стол. Может быть изготов- лен как со стеллажом (надстрой- кой с полками), так и без него.'
        },
        {
          id: 93,
          title: 'СТУЛ ДЛЯ ПРЕПОДАВАТЕЛЯ',
          desc: 'Стол лабораторный для кабинетов химии, физики и биологии',
          image: O4,
          more:'Указан размер одного стола. При необходимости столы могут ком- пановаться в один общий лабора- торный стол. Может быть изготов- лен как со стеллажом (надстрой- кой с полками), так и без него.'
        },
        {
          id: 94,
          title: 'ШКАФ ПОЛУЗАКРЫТЫЙ ДЛЯ КНИГ И ДОКУМЕНТОВ',
          desc: 'Стол лабораторный для кабинетов химии, физики и биологии',
          image: O5,
          more:'Указан размер одного стола. При необходимости столы могут ком- пановаться в один общий лабора- торный стол. Может быть изготов- лен как со стеллажом (надстрой- кой с полками), так и без него.'
        },
        {
          id: 95,
          title: 'СТОЛ ОДНОТУМБОВЫЙ',
          desc: 'Стол лабораторный для кабинетов химии, физики и биологии',
          image: O6,
          more:'Указан размер одного стола. При необходимости столы могут ком- пановаться в один общий лабора- торный стол. Может быть изготов- лен как со стеллажом (надстрой- кой с полками), так и без него.'
        },
        {
          id: 96,
          title: 'СТУЛ ПОЛУМЯГКИЙ',
          desc: 'Стол лабораторный для кабинетов химии, физики и биологии',
          image: O7,
          more:'Указан размер одного стола. При необходимости столы могут ком- пановаться в один общий лабора- торный стол. Может быть изготов- лен как со стеллажом (надстрой- кой с полками), так и без него.'
        },
        {
          id: 97,
          title: 'ШКАФ ДЛЯ ОДЕЖДЫ',
          desc: 'Стол лабораторный для кабинетов химии, физики и биологии',
          image: O8,
          more:'Указан размер одного стола. При необходимости столы могут ком- пановаться в один общий лабора- торный стол. Может быть изготов- лен как со стеллажом (надстрой- кой с полками), так и без него.'
        },
        {
          id: 98,
          title: 'ШКАФ ЗАКРЫТЫЙ',
          desc: 'Стол лабораторный для кабинетов химии, физики и биологии',
          image: O9,
          more:'Указан размер одного стола. При необходимости столы могут ком- пановаться в один общий лабора- торный стол. Может быть изготов- лен как со стеллажом (надстрой- кой с полками), так и без него.'
        },
        {
          id: 99,
          title: 'ШКАФ ОТКРЫТЫЙ',
          desc: 'Стол лабораторный для кабинетов химии, физики и биологии',
          image: O10,
          more:'Указан размер одного стола. При необходимости столы могут ком- пановаться в один общий лабора- торный стол. Может быть изготов- лен как со стеллажом (надстрой- кой с полками), так и без него.'
        },
      ],
      ShowFullItem: false,
      fullItem: {}
    }
    this.onShowItem = this.onShowItem.bind(this)
  }
  render() {
    return (
      <>
        <Header />
        <div className='font-sizw-catalog'>
          <div className="bloc-80">
            <div className="bacground2">
              <div className="size-spisok blac">
                <h1 className="left-3 color font-sizw-catalog">Весь ассортимент товаров</h1>

              </div>
            </div>
          </div>
        </div>

        <Items onShowItem={this.onShowItem} item={this.state.item} />
        {this.state.ShowFullItem && <ShowFullItem item={this.state.fullItem} onShowItem={this.onShowItem} />}
      </>
    )
  }
  onShowItem(item) {
    this.setState({ fullItem: item })
    this.setState({ ShowFullItem: !this.state.ShowFullItem });
  }

}
export default All
